Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: The Celery process has to be executed under the same user as the WSGI process, otherwise files in the :setting:`DATA_DIR` will be stored with mixed ownership, leading to runtime issues.
sv: Celery-processen mÃ¥ste kÃ¶ras under samma anvÃ¤ndare som WSGI-processen, annars kommer filer i :setting:`DATA_DIR` att lagras med blandad Ã¤garskap, vilket leder till problem vid kÃ¶rning.

source: See also :ref:`file-permissions` and :ref:`server`.
sv: Se Ã¤ven :ref:`file-permissions` och :ref:`server`.

source: Executing Celery tasks in the WSGI using eager mode
sv: UtfÃ¶ra Celery-uppgifter i WSGI med eager-lÃ¤ge

source: This will have severe performance impact on the web interface, and will break features depending on regular trigger (for example committing pending changes, digest notifications, or backups).
sv: Detta kommer att ha en allvarlig inverkan pÃ¥ webbgrÃ¤nssnittets prestanda och kommer att stÃ¶ra funktioner som Ã¤r beroende av regelbundna utlÃ¶sare (till exempel att bekrÃ¤fta vÃ¤ntande Ã¤ndringar, sammanfattande aviseringar eller sÃ¤kerhetskopieringar).

source: For development, you might want to use eager configuration, which does process all tasks in place:
sv: FÃ¶r utveckling kan du anvÃ¤nda ivrig konfiguration, som bearbetar alla uppgifter pÃ¥ plats:

source: Running Celery as system service
sv: KÃ¶r Celery som systemtjÃ¤nst

source: Most likely you will want to run Celery as a daemon and that is covered by :doc:`celery:userguide/daemonizing`. For the most common Linux setup using systemd, you can use the example files shipped in the :file:`examples` folder listed below.
sv: Troligtvis vill du kÃ¶ra Celery som en daemon, vilket beskrivs i :doc:`celery:userguide/daemonizing`. FÃ¶r den vanligaste Linux-konfigurationen med systemd kan du anvÃ¤nda exempelfilerna i mappen :file:`examples` som anges nedan.

source: Systemd unit to be placed as :file:`/etc/systemd/system/celery-weblate.service`:
sv: Systemd-enhet som ska placeras som :file:`/etc/systemd/system/celery-weblate.service`:

source: Environment configuration to be placed as :file:`/etc/default/celery-weblate`:
sv: MiljÃ¶konfiguration som ska placeras som :file:`/etc/default/celery-weblate`:

source: Additional configuration to rotate Celery logs using :command:`logrotate` to be placed as :file:`/etc/logrotate.d/celery`:
sv: Ytterligare konfiguration fÃ¶r att rotera Celery-loggar med :command:`logrotate` som ska placeras som :file:`/etc/logrotate.d/celery`:

source: Periodic tasks using Celery beat
sv: Periodiska uppgifter med Celery beat

source: Weblate comes with built-in setup for scheduled tasks. The task schedule is stored in the database and tasks are executed by the Celery beat daemon.
sv: Weblate har en inbyggd funktion fÃ¶r schemalagda uppgifter. Uppgiftsschemat lagras i databasen och uppgifterna utfÃ¶rs av Celery beat-daemon.

source: You can define additional tasks in :file:`settings.py`, for example see :ref:`lazy-commit`.
sv: Du kan definiera ytterligare uppgifter i :file:`settings.py`, se till exempel :ref:`lazy-commit`.

source: Monitoring Celery status
sv: Ãvervakning av Celery-status

source: You can find current length of the Celery task queues in the :ref:`management-interface` or you can use :wladmin:`celery_queues` on the command-line. In case the queue will get too long, you will also get configuration error in the admin interface.
sv: Du kan se den aktuella lÃ¤ngden pÃ¥ Celery-uppgiftskÃ¶erna i :ref:`management-interface` eller anvÃ¤nda :wladmin:`celery_queues` pÃ¥ kommandoraden. Om kÃ¶n blir fÃ¶r lÃ¥ng fÃ¥r du ocksÃ¥ ett konfigurationsfel i admin-grÃ¤nssnittet.

source: The Celery errors are by default only logged into Celery log and are not visible to user. In case you want to have overview on such failures, it is recommended to configure :ref:`collecting-errors`.
sv: Celery-fel loggas som standard endast i Celery-loggen och Ã¤r inte synliga fÃ¶r anvÃ¤ndaren. Om du vill ha en Ã¶versikt Ã¶ver sÃ¥dana fel rekommenderas det att konfigurera :ref:`collecting-errors`.

source: Single-process Celery setup
sv: Enkelprocess-konfiguration av Celery

source: In case you have very limited memory, you might want to reduce number of Weblate processes. All Celery tasks can be executed in a single process using:
sv: Om du har mycket begrÃ¤nsat minne kan du minska antalet Weblate-processer. Alla Celery-uppgifter kan utfÃ¶ras i en enda process med hjÃ¤lp av:

source: An installation using Docker can be configured to use a single-process Celery setup by setting :envvar:`CELERY_SINGLE_PROCESS`.
sv: En installation som anvÃ¤nder Docker kan konfigureras fÃ¶r att anvÃ¤nda en enkelprocess-Celery-konfiguration genom att stÃ¤lla in :envvar:`CELERY_SINGLE_PROCESS`.

source: This will have a noticeable performance impact on Weblate.
sv: Detta kommer att ha en mÃ¤rkbar inverkan pÃ¥ Weblates prestanda.

source: Monitoring Weblate
sv: Ãvervakning av Weblate

source: Weblate provides the ``/healthz/`` URL to be used in simple health checks, for example using Kubernetes. The Docker container has built-in health check using this URL.
sv: Weblate tillhandahÃ¥ller URL:en ``/healthz/`` som kan anvÃ¤ndas fÃ¶r enkla hÃ¤lsokontroller, till exempel med Kubernetes. Docker-containern har en inbyggd hÃ¤lsokontroll som anvÃ¤nder denna URL.

source: For monitoring metrics of Weblate you can use :http:get:`/api/metrics/` API endpoint.
sv: FÃ¶r att Ã¶vervaka mÃ¤tvÃ¤rden fÃ¶r Weblate kan du anvÃ¤nda API-Ã¤ndpunkten :http:get:`/api/metrics/`.

source: `Weblate plugin for Munin <https://github.com/WeblateOrg/munin>`_
sv: `Weblate-plugin fÃ¶r Munin <https://github.com/WeblateOrg/munin>`_

source: Collecting error reports and monitoring performance
sv: Insamling av felrapporter och Ã¶vervakning av prestanda

source: Weblate, as any other software, can fail. In order to collect useful failure states we recommend to use third party services to collect such information. This is especially useful in case of failing Celery tasks, which would otherwise only report error to the logs and you won't get notified on them. Weblate has support for the following services:
sv: Weblate kan, precis som all annan programvara, drabbas av fel. FÃ¶r att samla in anvÃ¤ndbar information om fel rekommenderar vi att du anvÃ¤nder tjÃ¤nster frÃ¥n tredje part fÃ¶r att samla in sÃ¥dan information. Detta Ã¤r sÃ¤rskilt anvÃ¤ndbart vid fel i Celery-uppgifter, som annars endast skulle rapportera felet till loggarna utan att du fÃ¥r nÃ¥gon avisering om det. Weblate har stÃ¶d fÃ¶r fÃ¶ljande tjÃ¤nster:

source: Weblate has built-in support for `Sentry <https://sentry.io/>`_. To use it, it's enough to set :setting:`SENTRY_DSN` in the :file:`settings.py`:
sv: Weblate har inbyggt stÃ¶d fÃ¶r `Sentry <https://sentry.io/>`_. FÃ¶r att anvÃ¤nda det rÃ¤cker det att stÃ¤lla in :setting:`SENTRY_DSN` i :file:`settings.py`:

source: Sentry can be also used to monitor performance of Weblate by collecting traces and profiles for defined percentage of operations. This can be configured using :setting:`SENTRY_TRACES_SAMPLE_RATE` and :setting:`SENTRY_PROFILES_SAMPLE_RATE`.
sv: Sentry kan ocksÃ¥ anvÃ¤ndas fÃ¶r att Ã¶vervaka Weblates prestanda genom att samla in spÃ¥r och profiler fÃ¶r en definierad procentandel av operationerna. Detta kan konfigureras med hjÃ¤lp av :setting:`SENTRY_TRACES_SAMPLE_RATE` och :setting:`SENTRY_PROFILES_SAMPLE_RATE`.

source: Weblate has built-in support for `Rollbar <https://rollbar.com/>`_. To use it, it's enough to follow instructions for `Rollbar notifier for Python <https://docs.rollbar.com/docs/python/>`_.
sv: Weblate har inbyggt stÃ¶d fÃ¶r `Rollbar <https://rollbar.com/>`_. FÃ¶r att anvÃ¤nda det rÃ¤cker det att fÃ¶lja instruktionerna fÃ¶r `Rollbar notifier fÃ¶r Python <https://docs.rollbar.com/docs/python/>`_.

source: In short, you need to adjust :file:`settings.py`:
sv: Kort sagt mÃ¥ste du justera :file:`settings.py`:

source: Everything else is integrated automatically, you will now collect both server and client side errors.
sv: Allt annat integreras automatiskt, och du kommer nu att samla in bÃ¥de server- och klientsidefel.

source: Error logging also includes exceptions that were gracefully handled, but might indicate a problem - such as failed parsing of an uploaded file.
sv: Felregistrering omfattar Ã¤ven undantag som hanterats pÃ¥ ett korrekt sÃ¤tt, men som kan tyda pÃ¥ ett problem â till exempel misslyckad analys av en uppladdad fil.

source: Graylog log management
sv: Graylog logghantering

source: Weblate can be configured to log using the GELF TCP protocol. This was developed for Graylog integration, but can be used with any compliant logging platform.
sv: Weblate kan konfigureras fÃ¶r att logga med hjÃ¤lp av GELF TCP-protokollet. Detta utvecklades fÃ¶r Graylog-integration, men kan anvÃ¤ndas med alla kompatibla loggningsplattformar.

source: The configuration boilerplate is included in :ref:`sample-configuration`, for Docker this can be configured using :envvar:`WEBLATE_LOG_GELF_HOST`.
sv: Konfigurationsmallarna finns i :ref:`sample-configuration`. FÃ¶r Docker kan detta konfigureras med :envvar:`WEBLATE_LOG_GELF_HOST`.

source: Migrating Weblate to another server
sv: Migrera Weblate till en annan server

source: Migrating Weblate to another server should be pretty easy, however it stores data in few locations which you should migrate carefully. The best approach is to stop Weblate for the migration.
sv: Att migrera Weblate till en annan server bÃ¶r vara ganska enkelt, men det lagrar data pÃ¥ flera platser som du bÃ¶r migrera noggrant. Det bÃ¤sta sÃ¤ttet Ã¤r att stoppa Weblate under migreringen.

source: Migrating database
sv: Migrering av databas

source: Depending on your database backend, you might have several options to migrate the database. The most straightforward approach is to use database native tools, as they are usually the most effective (e.g. :command:`mysqldump` or :command:`pg_dump`). Alternatively you can use replication in case your database supports it.
sv: Beroende pÃ¥ din databasbackend kan du ha flera alternativ fÃ¶r att migrera databasen. Det enklaste sÃ¤ttet Ã¤r att anvÃ¤nda databasens egna verktyg, eftersom de oftast Ã¤r mest effektiva (t.ex. :command:`mysqldump` eller :command:`pg_dump`). Alternativt kan du anvÃ¤nda replikering om din databas stÃ¶der det.

source: Migrating between databases described in :ref:`database-migration`.
sv: Migrering mellan databaser beskrivs i :ref:`database-migration`.

source: Migrating VCS repositories
sv: Migrera VCS-arkiv

source: The VCS repositories stored under :setting:`DATA_DIR` need to be migrated as well. You can simply copy them or use :command:`rsync` to do the migration more effectively.
sv: VCS-arkiven som lagras under :setting:`DATA_DIR` mÃ¥ste ocksÃ¥ migreras. Du kan helt enkelt kopiera dem eller anvÃ¤nda :command:`rsync` fÃ¶r att gÃ¶ra migreringen mer effektivt.

source: Other notes
sv: Ãvriga anmÃ¤rkningar

source: Don't forget to move other services Weblate might have been using like Valkey, Redis, Cron jobs or custom authentication backends.
sv: GlÃ¶m inte att flytta andra tjÃ¤nster som Weblate kan ha anvÃ¤nt, sÃ¥som Valkey, Redis, Cron-jobb eller anpassade autentiseringsbackends.

source: Installing using Docker
sv: Installera med Docker

source: With dockerized Weblate deployment you can get your personal Weblate instance up and running in seconds. All of Weblate's dependencies are already included. PostgreSQL is set up as the default database and Valkey as a caching backend.
sv: Med dockeriserad Weblate-distribution kan du fÃ¥ din personliga Weblate-instans igÃ¥ng pÃ¥ nÃ¥gra sekunder. Alla Weblates beroenden ingÃ¥r redan. PostgreSQL Ã¤r instÃ¤llt som standarddatabas och Valkey som caching-backend.

source: The following examples assume you have a working Docker environment, with ``docker-compose-plugin`` installed. Please check the Docker documentation for instructions.
sv: FÃ¶ljande exempel fÃ¶rutsÃ¤tter att du har en fungerande Docker-miljÃ¶ med ``docker-compose-plugin`` installerat. Se Docker-dokumentationen fÃ¶r instruktioner.

source: This creates a Weblate deployment server via HTTP, so you should place it behind HTTPS terminating proxy. You can also deploy with a HTTPS proxy, see :ref:`docker-https-portal`. For larger setups, please see :ref:`docker-scaling`.
sv: Detta skapar en Weblate-distributionsserver via HTTP, sÃ¥ du bÃ¶r placera den bakom en HTTPS-termineringsproxy. Du kan ocksÃ¥ distribuera med en HTTPS-proxy, se :ref:`docker-https-portal`. FÃ¶r stÃ¶rre installationer, se :ref:`docker-scaling`.

source: Clone the weblate-docker repo:
sv: Klonera weblate-docker-repo:

source: Create a :file:`docker-compose.override.yml` file with your settings. See :ref:`docker-environment` for full list of environment variables.
sv: Skapa en :file:`docker-compose.override.yml`-fil med dina instÃ¤llningar. Se :ref:`docker-environment` fÃ¶r en fullstÃ¤ndig lista Ã¶ver miljÃ¶variabler.

source: If :envvar:`WEBLATE_ADMIN_PASSWORD` is not set, the admin user is created with a random password shown on first startup.
sv: Om :envvar:`WEBLATE_ADMIN_PASSWORD` inte Ã¤r instÃ¤llt skapas administratÃ¶rsanvÃ¤ndaren med ett slumpmÃ¤ssigt lÃ¶senord som visas vid fÃ¶rsta start.

source: The provided example makes Weblate listen on port 80, edit the port mapping in the :file:`docker-compose.override.yml` file to change it.
sv: I det angivna exemplet lyssnar Weblate pÃ¥ port 80. Ãndra portmappningen i filen :file:`docker-compose.override.yml` fÃ¶r att Ã¤ndra den.

source: Start Weblate containers:
sv: Starta Weblate-containrar:

source: Enjoy your Weblate deployment, it's accessible on port 80 of the ``weblate`` container.
sv: Njut av din Weblate-distribution, den Ã¤r tillgÃ¤nglig pÃ¥ port 80 i ``weblate``-containern.

source: Choosing Docker image registry
sv: VÃ¤lja Docker-bildregister

source: Weblate containers are published to following registries:
sv: Weblate-containrar publiceras i fÃ¶ljande register:

source: Docker Hub, see https://hub.docker.com/r/weblate/weblate
sv: Docker Hub, se https://hub.docker.com/r/weblate/weblate

source: GitHub Packages registry, see https://github.com/WeblateOrg/docker/pkgs/container/weblate
sv: GitHub Packages-registret, se https://github.com/WeblateOrg/docker/pkgs/container/weblate

source: All examples currently fetch images from Docker Hub, please adjust the configuration accordingly to use a different registry.
sv: Alla exempel hÃ¤mtar fÃ¶r nÃ¤rvarande bilder frÃ¥n Docker Hub. Justera konfigurationen efter behov fÃ¶r att anvÃ¤nda ett annat register.

source: Choosing Docker image tag
sv: VÃ¤lja Docker-bildtagg

source: Please choose a tag that matches your environment and expectations:
sv: VÃ¤lj en tagg som passar din miljÃ¶ och dina fÃ¶rvÃ¤ntningar:

source: Tag name
sv: Taggnamn

source: Use case
sv: AnvÃ¤ndningsfall

source: Weblate stable release, matches latest tagged release
sv: Weblate stabil version, motsvarar senaste taggade versionen

source: Rolling updates in a production environment
sv: Rullande uppdateringar i en produktionsmiljÃ¶

source: Weblate stable release
sv: Weblate stabil utgÃ¥va

source: Rolling updates within a major version in a production environment
sv: Rullande uppdateringar inom en huvudversion i en produktionsmiljÃ¶

source: Rolling updates within a minor version in a production environment
sv: Rullande uppdateringar inom en mindre version i en produktionsmiljÃ¶

source: Well defined deploy in a production environment
sv: VÃ¤l definierad distribution i en produktionsmiljÃ¶

source: Weblate stable release with development changes in the Docker container (for example updated dependencies)
sv: Weblate stabil release med utvecklingsÃ¤ndringar i Docker-containern (till exempel uppdaterade beroenden)

source: Rolling updates in a staging environment
sv: Rullande uppdateringar i en stagingmiljÃ¶

source: Well defined deploy in a staging environment
sv: VÃ¤l definierad distribution i en stagingmiljÃ¶

source: Development version Weblate from Git
sv: Utvecklingsversion Weblate frÃ¥n Git

source: Rollling updates to test upcoming Weblate features
sv: Rullande uppdateringar fÃ¶r att testa kommande Weblate-funktioner

source: Well defined deploy to test upcoming Weblate features
sv: VÃ¤l definierad distribution fÃ¶r att testa kommande Weblate-funktioner

source: Every image is tested by our CI before it gets published, so even the `bleeding` version should be quite safe to use.
sv: Varje bild testas av vÃ¥r CI innan den publiceras, sÃ¥ Ã¤ven den "blÃ¶dande" versionen bÃ¶r vara ganska sÃ¤ker att anvÃ¤nda.

source: Full list of published tags can be found at `GitHub Packages`_
sv: En fullstÃ¤ndig lista Ã¶ver publicerade taggar finns pÃ¥ `GitHub Packages`_

source: Docker container with HTTPS support
sv: Docker-container med HTTPS-stÃ¶d

source: Please see :ref:`docker-deploy` for generic deployment instructions, this section only mentions differences compared to it.
sv: Se :ref:`docker-deploy` fÃ¶r generella installationsinstruktioner. Detta avsnitt beskriver endast skillnaderna jÃ¤mfÃ¶rt med dessa.

source: SSL terminating proxy
sv: SSL-terminerande proxy

source: SSL can be terminated outside Weblate container. To make this work well together, several headers need to be passed to the container so that it is aware of its actual environment. In more detail, these headers are described in :ref:`reverse-proxy`.
sv: SSL kan avslutas utanfÃ¶r Weblate-containern. FÃ¶r att detta ska fungera vÃ¤l mÃ¥ste flera rubriker skickas till containern sÃ¥ att den kÃ¤nner till sin faktiska miljÃ¶. Dessa rubriker beskrivs mer detaljerat i :ref:`reverse-proxy`.

source: Example nginx reverse proxy configuration for a Docker container.
sv: Exempel pÃ¥ nginx-konfiguration fÃ¶r omvÃ¤nd proxy fÃ¶r en Docker-container.

source: Docker container environment for external SSL termination.
sv: Docker-containermiljÃ¶ fÃ¶r extern SSL-terminering.

source: Using own SSL certificates
sv: AnvÃ¤nda egna SSL-certifikat

source: In case you have own SSL certificate you want to use, simply place the files into the Weblate data volume (see :ref:`docker-volume`):
sv: Om du har ett eget SSL-certifikat som du vill anvÃ¤nda, placera helt enkelt filerna i Weblate-datavolymen (se :ref:`docker-volume`):

source: :file:`ssl/fullchain.pem` containing the certificate including any needed CA certificates
sv: :file:`ssl/fullchain.pem` som innehÃ¥ller certifikatet inklusive alla nÃ¶dvÃ¤ndiga CA-certifikat

source: :file:`ssl/privkey.pem` containing the private key
sv: :file:`ssl/privkey.pem` som innehÃ¥ller den privata nyckeln

source: Both of these files must be owned by the same user as the one starting the docker container and have file mask set to ``600`` (readable and writable only by the owning user).
sv: BÃ¥da dessa filer mÃ¥ste Ã¤gas av samma anvÃ¤ndare som den som startar docker-containern och ha filmasken instÃ¤lld pÃ¥ ``600`` (lÃ¤sbar och skrivbar endast av den Ã¤gande anvÃ¤ndaren).

source: Additionally, Weblate container will now accept SSL connections on port 4443, you will want to include the port forwarding for HTTPS in docker compose override:
sv: Dessutom accepterar Weblate-containern nu SSL-anslutningar pÃ¥ port 4443. Du bÃ¶r inkludera portvidarebefordran fÃ¶r HTTPS i docker compose override:

source: If you already host other sites on the same server, it is likely ports ``80`` and ``443`` are used by a reverse proxy, such as NGINX. To pass the HTTPS connection from NGINX to the docker container, you can use the following configuration:
sv: Om du redan Ã¤r vÃ¤rd fÃ¶r andra webbplatser pÃ¥ samma server Ã¤r det troligt att portarna ``80`` och ``443`` anvÃ¤nds av en omvÃ¤nd proxy, till exempel NGINX. FÃ¶r att vidarebefordra HTTPS-anslutningen frÃ¥n NGINX till docker-containern kan du anvÃ¤nda fÃ¶ljande konfiguration:

source: Replace ``<SITE_URL>``, ``<SITE>`` and ``<EXPOSED_DOCKER_PORT>`` with actual values from your environment.
sv: ErsÃ¤tt ``<SITE_URL>``, ``<SITE>`` och ``<EXPOSED_DOCKER_PORT>`` med faktiska vÃ¤rden frÃ¥n din miljÃ¶.

source: Automatic SSL certificates using Letâs Encrypt
sv: Automatiska SSL-certifikat med Letâs Encrypt

source: In case you want to use `Letâs Encrypt <https://letsencrypt.org/>`_ automatically generated SSL certificates on public installation, you need to add a reverse HTTPS proxy an additional Docker container, `https-portal <https://hub.docker.com/r/steveltn/https-portal/>`_ will be used for that. This is made use of in the :file:`docker-compose-https.yml` file. Then create a :file:`docker-compose-https.override.yml` file with your settings:
sv: Om du vill anvÃ¤nda `Letâs Encrypt <https://letsencrypt.org/>`_ automatiskt genererade SSL-certifikat pÃ¥ en offentlig installation mÃ¥ste du lÃ¤gga till en omvÃ¤nd HTTPS-proxy och en extra Docker-container, `https-portal <https://hub.docker.com/r/steveltn/https-portal/>`_ kommer att anvÃ¤ndas fÃ¶r det. Detta anvÃ¤nds i filen :file:`docker-compose-https.yml`. Skapa sedan en :file:`docker-compose-https.override.yml`-fil med dina instÃ¤llningar:

source: Whenever invoking :program:`docker compose` you need to pass both files to it, and then do:
sv: NÃ¤r du anropar :program:`docker compose` mÃ¥ste du skicka bÃ¥da filerna till det och sedan gÃ¶ra fÃ¶ljande:

source: Upgrading the Docker container
sv: Uppgradering av Docker-containern

source: Usually it is good idea to only update the Weblate container and keep the PostgreSQL container at the version you have, as upgrading PostgreSQL is quite painful and in most cases does not bring many benefits.
sv: Vanligtvis Ã¤r det en bra idÃ© att endast uppdatera Weblate-containern och behÃ¥lla PostgreSQL-containern i den version du har, eftersom det Ã¤r ganska besvÃ¤rligt att uppgradera PostgreSQL och i de flesta fall inte ger nÃ¥gra stÃ¶rre fÃ¶rdelar.

source: Since Weblate 4.17-1, the Docker container uses Django 4.2 what requires PostgreSQL 12 or newer, please upgrade it prior to upgrading Weblate. See :ref:`docker-postgres-upgrade`.
sv: Sedan Weblate 4.17-1 anvÃ¤nder Docker-containern Django 4.2, vilket krÃ¤ver PostgreSQL 12 eller nyare. Uppgradera detta innan du uppgraderar Weblate. Se :ref:`docker-postgres-upgrade`.

source: You can do this by sticking with the existing docker-compose and just pull the latest images and then restart:
sv: Du kan gÃ¶ra detta genom att behÃ¥lla den befintliga docker-compose och bara hÃ¤mta de senaste bilderna och sedan starta om:

source: The Weblate database should be automatically migrated on first startup, and there should be no need for additional manual actions.
sv: Weblate-databasen bÃ¶r migreras automatiskt vid fÃ¶rsta start, och det bÃ¶r inte behÃ¶vas nÃ¥gra ytterligare manuella Ã¥tgÃ¤rder.

source: Upgrades across major versions are not supported by Weblate. For example, if you are on 3.x series and want to upgrade to 4.x, first upgrade to the latest 4.0.x-y image (at time of writing this it is the ``4.0.4-5``), which will do the migration and then continue upgrading to newer versions.
sv: Uppgraderingar mellan stÃ¶rre versioner stÃ¶ds inte av Weblate. Om du till exempel anvÃ¤nder version 3.x och vill uppgradera till 4.x mÃ¥ste du fÃ¶rst uppgradera till den senaste 4.0.x-y-bilden (vid skrivande stund Ã¤r det ``4.0.4-5``), som kommer att utfÃ¶ra migreringen, och sedan fortsÃ¤tta uppgraderingen till nyare versioner.

source: You might also want to update the ``docker-compose`` repository, though it's not needed in most case. See :ref:`docker-postgres-upgrade` for upgrading the PostgreSQL server.
sv: Du kanske ocksÃ¥ vill uppdatera ``docker-compose``-arkivet, Ã¤ven om det i de flesta fall inte behÃ¶vs. Se :ref:`docker-postgres-upgrade` fÃ¶r uppgradering av PostgreSQL-servern.

source: Upgrading PostgreSQL container
sv: Uppgradering av PostgreSQL-container
